`terraform plan`
```
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.members.github_membership.member["Liscome"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "Liscome"
    }

  # module.members.github_membership.member["PL-38"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "PL-38"
    }

  # module.hackathon.module.h24s_children_teams["h24s_17"].github_team.team will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "h24s_17"
      + node_id                   = (known after apply)
      + parent_team_id            = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.hackathon.module.h24s_children_teams["h24s_17"].github_team_members.team_members will be created
  + resource "github_team_members" "team_members" {
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "maintainer"
          + username = "H1rono"
        }
      + members {
          + role     = "maintainer"
          + username = "itt828"
        }
      + members {
          + role     = "member"
          + username = "ErrorSyntax1"
        }
      + members {
          + role     = "member"
          + username = "Liscome"
        }
      + members {
          + role     = "member"
          + username = "PL-38"
        }
    }

  # module.hackathon.module.h24s_parent_team.github_team.team will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "2024春ハッカソン"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "hackathon_24_spring"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.hackathon.module.h24s_parent_team.github_team_members.team_members will be created
  + resource "github_team_members" "team_members" {
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "maintainer"
          + username = "H1rono"
        }
      + members {
          + role     = "maintainer"
          + username = "Takeno-hito"
        }
      + members {
          + role     = "maintainer"
          + username = "ikura-hamu"
        }
      + members {
          + role     = "maintainer"
          + username = "kaitoyama"
        }
      + members {
          + role     = "member"
          + username = "ErrorSyntax1"
        }
      + members {
          + role     = "member"
          + username = "H1rono"
        }
      + members {
          + role     = "member"
          + username = "Liscome"
        }
      + members {
          + role     = "member"
          + username = "PL-38"
        }
      + members {
          + role     = "member"
          + username = "itt828"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

guarantee to take exactly these actions if you run "terraform apply" now.

```